{
    "addr scan/tcp": {
        "name": "Addr Scan/tcp", 
        "mitigation": "Mitigation is not available for the alarm associated with this security event.", 
        "meaning": "A host is attempting to discover which hosts are running particular services to potentially make use of.", 
        "steps": "Determine what the host was scanning. Start this investigation with a broad net and then narrow it down.Begin by running a Top Ports (outbound) report. Set the time period to the day of the event and the client host to be the source IP of the event. Regardless of the target IP range that is listed, you can scan any type of host,  so determine if you want to search on Inside Hosts, Outside Hosts, or both. Then, in the Filter dialog, set the Server filter as appropriate on the Hosts tab and set the \"Order the records returned by\" to Flows on the Advanced tab.Once the results come back, it may be helpful to sort by Peers. Regardless, start at the top of the list as sorted by Flows or Peers to find the standout ports that either don’t belong or appear abnormally high. Right-click an IP address to pivot to the flows to view the various IP addresses and determine if par-ticular host groups are those being primarily targeted. You can also right-click and pivot to the Top Peers report to determine whether or not the traffic is spread generally equally across the targets. It is also worth noting the percentage of hosts that responded to the scans. At this point you should be able to determine who the host was scanning and what ports were being scanned."
    }, 
    "addr scan/udp": {
        "name": "Addr Scan/udp", 
        "mitigation": "Mitigation is not available for the alarm associated with this security event.", "meaning": "A host attempting to discover which hosts are running particular services to potentially make use of.", 
        "steps": "Determine what the host was scanning. Start this investigation with a broad net and then narrow it down.Begin by running a Top Ports (outbound) report. Set the time period to the day of the event and the client host to be the source IP of the event. Regardless of the target IP range that is listed, you can scan any type of host,  so determine if you want to search on Inside Hosts, Outside Hosts, or both. Then, in the Filter dialog, set the Server filter as appropriate on the Hosts tab and set the \"Order the records returned by\" to Flows on the Advanced tab.Once the results come back, it may be helpful to sort by Peers. Regardless, start at the top of the list as sorted by Flows or Peers to find the standout ports that either don’t belong or appear abnormally high. Right-click an IP address to pivot to the flows to view the various IP addresses and determine if par-ticular host groups are those being primarily targeted. You can also right-click and pivot to the Top Peers report to determine whether or not the traffic is spread generally equally across the targets. It is also worth noting the percentage of hosts that responded to the scans. At this point you should be able to determine who the host was scanning and what ports were being scanned."
    }, 
    "bad flag ack": {
        "name": "Bad Flag ACK", 
        "mitigation": "Mitigation is not available for the alarm associated with this security event.", 
        "meaning": "A TCP packet with invalid flags set should not normally happen. When it does happen, it has likely been done intentionally in an attempt to gather information about the machine to which the packet is sent since dif-ferent system configurations may respond to different anomalous flag combinations dif-ferently.", 
        "steps": "If the source of this event is an inside host, it is worth looking for other signs of recon activ-ity. For example, is the host sending bad flag combinations to multiple hosts? Is it scanning many hosts on the same port? Is it scanning many ports on one host? An inside host per-forming reconnaissance can be a good sign of unwanted activity or compromise."
    }, 
    "bad flag all": {
        "name": "Bad Flag All",
        "mitigation": "Mitigation is not available for the alarm associated with this security event.", 
        "meaning": "A TCP packet with all flags set should not nor-mally happen. When it does happen, it has likely been done intentionally in an attempt to gather information about the machine to which the packet is sent since different sys-tem configurations may respond to different anomalous flag combinations differently.",
        "steps": "If the source of this event is an inside host, it is worth looking for other signs of recon activ-ity. For example, is the host sending bad flag combinations to multiple hosts? Is it scanning many hosts on the same port? Is it scanning many ports on one host? An inside host per-forming reconnaissance can be a good sign of unwanted activity or compromise."
    }, 
    "bad flag noflg": {
        "name": "Bad Flag NoFlg",
        "mitigation": "Mitigation is not available for the alarm associated with this security event", 
        "meaning": "A TCP packet with invalid flags set should not normally happen. When it does happen, it has likely been done intentionally in an attempt to gather information about the machine to which the packet is sent since dif-ferent system configurations may respond to different anomalous flag combinations differently.", 
        "steps": "If the source of this event is an inside host, it is worth looking for other signs of recon activ-ity. For example, is the host sending bad flag combinations to multiple hosts? Is it scanning many hosts on the same port? Is it scanning many ports on one host? An inside host per-forming reconnaissance can be a good sign of unwanted activity or compromise."
    }, 
    "bad flag rsrvd": {
        "name": "Bad Flag Rsrvd",
        "mitigation": "Mitigation is not available for the alarm associated with this security event.", 
        "meaning": "A TCP packet with invalid flags set should not normally happen. When it does happen, it has likely been done intentionally in an attempt to gather information about the machine to which the packet is sent since different system configurations may respond to different anomalous flag combinations differently.",
        "steps": "If the source of this event is an inside host, it is worth looking for other signs of recon activ-ity. For example, is the host sending bad flag combinations to multiple hosts? Is it scanning many hosts on the same port? Is it scanning many ports on one host? An inside host per-forming reconnaissance can be a good sign of unwanted activity or compromise."
    }, 
    "bad flag rst": {
        "name": "Bad Flag RST",
        "mitigation": "Mitigation is not available for the alarm associated with this security event.", 
        "meaning": "A TCP packet with invalid flags set should not normally happen. When it does happen, it has likely been done intentionally in an attempt to gather information about the machine to which the packet is sent since different system configurations may respond to different anomalous flag combinations dif-ferently.", 
        "steps": "If the source of this event is an inside host, it is worth looking for other signs of recon activ-ity. For example, is the host sending bad flag combinations to multiple hosts? Is it scanning many hosts on the same port? Is it scanning many ports on one host? An inside host performing reconnaissance can be a good sign of unwanted activity or compromise."
    }, 
    "bad flag syn fin": {
        "name": "Bad Flag SYN FIN",
        "mitigation": "Mitigation is not available for the alarm associated with this security event.", 
        "meaning": "A TCP packet with invalid flags set should not normally happen. When it does happen, it has likely been done intentionally in an attempt to gather information about the machine to which the packet is sent since different system configurations may respond to different anomalous flag combinations differently.",
        "steps": "If the source of this event is an inside host, it is worth looking for other signs of recon activ-ity. For example, is the host sending bad flag combinations to multiple hosts? Is it scanning many hosts on the same port? Is it scanning many ports on one host? An inside host per-forming reconnaissance can be a good sign of unwanted activity or compromise."
    },
    "bad flag urg": {
        "name": "Bad Flag URG",
        "mitigation": "Mitigation is not available for the alarm associated with this security event.", 
        "meaning": "A TCP packet with invalid flags set should not normally happen. When it does happen, it has likely been done intentionally in an attempt to gather information about the machine to which the packet is sent since dif-ferent system configurations may respond to different anomalous flag combinations dif-ferently.",
        "steps": "If the source of this event is an inside host, it is worth looking for other signs of recon activ-ity. For example, is the host sending bad flag combinations to multiple hosts? Is it scanning many hosts on the same port? Is it scanning many ports on one host? An inside host per-forming reconnaissance can be a good sign of unwanted activity or compromise."
    }, 
    "beaconing host": {
        "name": "Beaconing Host",
        "mitigation": "Check Steps",
        "meaning": "A beaconing host is host looking for updates or commands from another. This traffic can be used for a variety of reasons, such as keep-alive (heartbeat), to obtain new orders from a Command and Control (C&C) server, or to download updates. It's important to realize that this behavior can be caused by malware, but that is not always the case.",
        "steps": "When investigating a Beaconing Host event, the goal is to determine if the Outside Host is indeed a C&C server. It can often be helpful to look this host up both inside of Stealth-watch and outside of it. \n A good first step within Stealthwatch is to open a Top Peers (Outbound) report on the target host. This will provide a list of inside peers sorted by the amount of data that have communicated with the Outside Host. This will tell you whether it is a very common peer within your environment or not. \n A second step would be to run a Flow Traffic report to visualize traffic patterns between the source and the Target. Communication with a C&C server will exhibit a periodic pat-tern with a fixed amount of outbound traffic."
    }, 
    "bot command & control server": {"name": "Bot Command & Control Server", "mitigation": "Check meaning", "meaning": "Indicates that a host in your environment is being used to assist in the compromise of other hosts beyond your environment by act-ing as a command and control (C&C) server. This host is also very likely compromised itself.", "steps": "n/a"}, "bot infected host-attempted c&c activity": {"name": "Bot Infected Host-Attempted C&C Activity", "mitigation": "Check Steps", "meaning": "A host on your network has attempted to talk to a known  command and control (C&C) server. Although the host was not successful in doing so, this is still concerning since something caused that host to make the attempt. Note that malware or a malicious redirect can also cause this behavior.", "steps": "This security event generally doesn't require too much validation within the product, but you should perform a flow query for flows between the target of the event and any other host to see if other hosts are interacting with the suspected C&C server. Set the time period of the query to the day of the event or longer. \n Depending on the duration of the com-munication, you can also use this query to determine when the source host began reach-ing out to the suspected C&C server. If you have many hosts communicating with the tar-get host or you see historical communication, it is possible that the C&C server has been falsely identified."}, "bot infected host-successful c&c activity": {"name": "Bot Infected Host-Successful C&C Activity", "mitigation": "Check Steps", "meaning": "A  host on your network has communicated with a known  command and control (C&C) server. It is possible that  this behavior has been caused by malware or a malicious redir-ect, or that this communication was an attempt at infection by, for example, an exploit kit. This is almost certainly sign of a compromised host.", "steps": "This security event generally doesn't require too much validation within the product, but you should perform a flow query for flows between the target of the event and any other host to see if other hosts are interacting with the suspected C&C server. Set the time period of the query to the day of the event or longer. \n Depending on the duration of the com-munication, you can also use this query to determine when the source host began reach-ing out to the suspected C&C server. If you have many hosts communicating with the tar-get host or you see historical communication, it is possible that the C&C server has been falsely identified"}, "brute force login": {"name": "Brute Force Login", "mitigation": "Check Steps", "meaning": "This may be indicative of a host trying to guess login credentials against another in an attempt to gain access to the system. It may also indicate a misconfigured application on the client which is attempting numerous repeat connections to the server and failing authentication.", "steps": "The goal is to determine if the connection attempt to the server is legitimate. If the cli-ent is an outside host, is the client address part of a known trusted or business partner network that may be expected to initiate these connections? If so, it may be a mis-configured application. You should also run an external lookup against DShield (for the target host) to verify the owner of the target IP in the security event alarm.  If the client is an inside host, would this host be expected to attempt these types of connections to the server in question? Running a Top Peers report for the source host may tell you if this host is connecting to other hosts on the net-work with similar byte counts or high number of flows. You can also run a Top Ports report to find other hosts that the source IP is connecting to over the same port for which the security event alarm triggered (probably SSH)."}, "connection from bogon address attempted": {"name": "Connection from Bogon Address Attempted", "mitigation": "Check Steps", "meaning": "A bogon address is an IP address which has not been assigned and should not be used. Unidirectional communication from one is generally not very concerning, however, it should not happen during regular use. In fact, this  sort of traffic is often blocked at a net-work's perimeter. A specific type of behavior to look for when seen in bulk is a denial-of-service (DoS) attack in which an attacker is spoofing source IP addresses.", "steps": "There are two things to initially look for when investigating unidirectional traffic from a bogon address: 1) Is the bogon address (or other bogon addresses) attempting to com-municate with other hosts in your network? 2) Is the host to which traffic is being sent from a bogon address receiving an abnormally large amount of traffic? \n To answer the first question, you can run either a Top Hosts query or a flow query against the bogon host group. You can run it specifically against the bogon IP from the security event, but in the event of spoofed traffic it is trivial for an attacker to use many different bogon IPs. Assess the results returned from your query to determine whether or not this is part of a DoS attack or is potentially a misconfiguration / unclassified host in your network. Generally, a large volume of data or packets is a sign of a DoS attack. \n To answer the second question, focus your query on the target host of the security event, since the goal is to find out if there is an abnormally large amount of traffic, whether from that bogon address or not. A quick  way to get some helpful information is to view the target host's other security events and look for DoS events like SYNs Received or New Flows Served, or look for an abundance of communication from bogons. \n To investigate a bit more thoroughly, run a Flow Traffic report. Set the Date/Time filter to include the time of the bogon communication as well as two hours before this. A longer time window will result in a longer query but will provide you with better context. Here you can also filter the hosts to include traffic only from outside hosts if you are not concerned about an internally launched DoS attack."}, "connection from bogon address successful": {"name": "Connection from Bogon Address Successful", "mitigation": "Check Steps", "meaning": "A bogon address is an IP address which has not been assigned and should not be used. Bidirectional communication  with a bogon address should  not occur. This behavior is most likely a sign of a misconfiguration within either your network or your Stealthwatch deployment.", "steps": "Determine if your environment actually uses a particular bogon IP address range internally or whether or not you use Carrier Grade NAT. If your environment uses a bogon range intern-ally and that is expected, simply add the range to your Inside Hosts group. A way to check this within the Stealthwatch System is to look for active flows in  the /24 of the bogon. If a large part of the range is active, it is likely a range being purposefully used within your environment. If the bogon IP is within 100.64.0.0/10, it is using IP space reserved for Carrier Grade NAT and is not an issue if your environment is behind one. If neither of these is the case, the Host Snap-shot (accessed within the SMC Desktop Cli-ent) will contain information to help you identify the  host. For example, the Exporter Interface tab displays which exporters and interfaces are  seeing the host's  flows to help you determine where the device is hosted. In addition, check out the Security Events tab, Alarms tab, and Identification tabs. These will show you any other behavior with which the bogon host has been involved. Finally, view the security events of the bogon host to see if there are any other hosts it has interacted with."}, "connection from tor attempted": {"name": "Connection from Tor Attempted", "mitigation": "Check Meaning", "meaning": "Detects attempted connections to host(s) inside your network from Tor exit nodes.", "steps": "n/a"}, "connection from tor successful": {"name": "Connection from Tor Successful", "mitigation": "Check Meaning", "meaning": "Detects successful connections to host(s) inside your network from Tor exit nodes.", "steps": "Check Meaning"}, "connection to bogon address attempted": {"name": "Connection to Bogon Address Attempted", "mitigation": "Check Steps", "meaning": "A bogon address is an IP address which has not been assigned and should not be used.  Unidirectional communication to one is a bit peculiar, since something must have promp-ted a host in your network to do so. It is pos-sible that this is backscatter from a denial-of-service (DoS) attack. This occurs when an attacker sends you packets with randomized source address as part of a distributed denial-of-service (DDoS) and you respond to those randomized addresses. If an attacker is randomizing the entire IP space, some of these will be bogon addresses. Unidirectional communication to a bogon IP may also be a sign of reconnaissance or a misconfigured host.", "steps": "Determine if your environment actually uses a particular bogon IP address range internally or whether or not you use Carrier Grade NAT. If your environment uses a bogon range intern-ally and that is expected, simply add the range to your Inside Hosts group. A way to check this within the Stealtwatch System is to look for active flows in  the /24 of the bogon. If a large part of the range is active, it is likely a range being purposefully used within your environment. If the bogon IP is within 100.64.0.0/10, it is using IP space reserved for Carrier Grade NAT and is not an issue if your environment is behind one. \n If neither of these are the case, review the other security events on the source of the event. Look for either an abundance of com-munication to bogons or denial-of-service (DoS) events like SYNs Received or New Flows Served. Also, look for recon-related events such as Ping Scan or Addr_Scan. To investigate a potential DDoS bit more thoroughly, run a Flow  Traffic report. Set the Date/Time filter to include the time of the Bogon communication as well as two hours before this. A longer time window will result in a longer query but will provide you with bet-ter context.  Here you can also filter the hosts to include traffic only from outside hosts if you are not concerned about an internally launched DoS attack. A large spike or even a gradual but large volume of traffic may be indicative of a DoS attack. \n If neither a DDoS or a large number of recon-naissance activity seem likely, view the secur-ity events of the bogon IP to see  if there are any other hosts that have attempted to inter-act with the bogon host. A large number of hosts attempting to interact  with a particular bogon suggest either an application had a bad configuration pushed out or an applic-ation hosted on  a bogon range disappeared. You can investigate this further by viewing the bogon's historical traffic."}, "connection to bogon address successful": {"name": "Connection to Bogon Address Successful", "mitigation": "Check Steps", "meaning": "A bogon address is an IP address which has not been assigned and should not be used. Bidirectional communication  with a bogon address should  not occur. This behavior is most likely a sign of a misconfiguration within either your network or your Stealthwatch deployment.", "steps": "Determine if your environment actually uses a particular bogon IP address range internally or whether or not you use Carrier Grade NAT. If your environment uses a bogon range intern-ally and that is expected, simply add the range to your Inside Hosts group. A way to check this within the Stealtwatch System is to look for active flows in  the /24 of the bogon. If a large part of the range is active, it is likely a range being purposefully used within your environment. If the bogon IP is within 100.64.0.0/10, it is using IP space reserved for Carrier Grade NAT and is not an issue if your environment is behind one. \n If neither of these is the case, the Host Snap-shot (accessed within the SMC Desktop Cli-ent) will contain information to help you identify the  host. For example, the Exporter Interface tab displays which exporters and interfaces are  seeing the host's  flows to help you determine where the device is hosted. In addition, check out the Security Events tab, Alarms tab, and Identification tabs. These will show you any other behavior with which the bogon host has been involved. Finally, view the security events of the bogon host to see if there are any other hosts it has interacted with"}, "connection to tor attempted": {"name": "Connection to Tor Attempted", "mitigation": "Check Meaning", "meaning": "Tor, formerly The Onion Router, is a network used for anonymizing Internet connections which works by sending a connection through multiple relays before exiting the Tor network. A Tor entry node is the first server a Tor connection  transits through before nav-igating and exiting the Tor network. This security event involves a host that is being monitored by your Stealthwatch System attempting to communicate with a Tor entry node but that was not observed establishing a successful connection. \n It is possible that this was either user-driven or malware attempting to find command and control traffic. If it was user-driven, this was likely an attempt at obfuscating the des-tination of the user's traffic or obfuscating the location from where the user was browsing. It is important to note that some Tor entry nodes run on servers that also run other ser-vices. For example, DuckDuckGo runs Tor entry nodes on the same server that is accessed to perform searches.", "steps": "Check Meaning"}, "connection to tor successful": {"name": "Connection to Tor Successful", "mitigation": "Check Meaning", "meaning": "Tor, formerly The Onion Router, is a network used for anonymizing Internet connections which works by sending a connection through multiple relays before exiting the Tor network. A Tor entry node is the first server a Tor connection  transits through before nav-igating and exiting the Tor network. This security event involves a host that is being monitored by your Stealthwatch System com-municating with a Tor entry node. \n It is possible that this was either user-driven or malware attempting to find command and control traffic. If it was user-driven, this was likely an attempt at obfuscating the des-tination of the user's traffic or obfuscating the location from where the user was browsing. It is important to note that some Tor entry nodes run on servers that also run other ser-vices. For example, DuckDuckGo runs Tor entry nodes on the same server that is accessed to perform searches.", "steps": "Check Meaning"}, "fake application detected": {"name": "Fake Application Detected", "mitigation": "Check Steps", "meaning": "This behavior is often a sign of a person or application attempting to circumvent egress filtering by sending traffic out of a commonly permitted port using a service other than the one intended. It will also look for standard applications over ports other than their stand-ard which can cause it to occasionally fire on applications using secondary ports, like SSH over TCP 8022.", "steps": "The goal of your investigation is to find the relevant flows, and then to attempt to determ-ine whether or not they appear to be signs of exfiltration or command and control. \n A first step in investigating this event is to consider the port attached to the event and the hosts involved. For example, if the target host is an offsite backup server and the event triggered on port 8022 that may not be of con-cern. On the other hand, if the target host is unfamiliar and you see non-DNS going out over 53 UDP it's likely worth a deeper look. \n There are a few options to investigate this- the event will list an associated port, and you can use it to build a very specific filter. For example, if you filter for flows between the two involved hosts over the involved port but also exclude flows using the 'proper' applic-ation (e.g. searching for flows over port 53 UDP that are not DNS) you'll find the flows that caused the event to fire. \n It may also be useful to run a more general query instead, filtering on just the source and target host of the event on the date of the event. This may turn up flows beyond just any that have a port / application mismatch, but the existence of any such flows may actual be valuable context in an investigation. \n Once you have a selection of flows to work with, examine the destination host, history, and data volume for signs of misuse."}, "flow denied": {"name": "Flow Denied", "mitigation": "Mitigation is not available for the alarm associated with this security event.", "meaning": "This is largely dependent on context. For example, Flow Denied from a host on the Internet is likely not that interesting, espe-cially as a single event. Flow Denied from an inside host to an inside host is different from inside to outside, and trying the same host/-port pairing over and over again is much dif-ferent from getting  blocked to a variety of destinations. \n If an inside host has many denied flows talk-ing to another inside host over one port, it is likely a misconfiguration. Many denied flows to a variety of ports or inside hosts is likely reconnaissance. Apart from that, it is a sign of a host doing things that you have determined it should not do, which makes it inherently interesting. Flows blocked from an inside host to the Internet require the context of what rules it is attempting to violate, but regardless, the host is doing something that your security policy has determined it should not be able to do.", "steps": "A good way to investigate Flows Denied is to perform a security event query on the source host of the event. Run the query for the day of the event, set the source host to be the source of the initial Flow Denied event, and then set the type to include only other Flow Denied events. This will show you all of the Flow Denied events for the host. From the returned results you can  determine whether it was a single denied flow, many denied flows over the same port to the same host, many denied flows to different hosts over the same port, many denied flows to the same host group, etc. This will enable you to figure out what behavior the host is actually engaging in."}, "frag packet too long": {"name": "Frag Packet Too Long", "mitigation": "Mitigation is not available for the alarm associated with this security event.", "meaning": "An IP packet with an invalid fragmentation value is not something that should normally happen. When it happens it has likely been done intentionally in an attempt to gather information about the machine the packet is sent to as different operating systems and versions may respond differently.", "steps": "If the source of this event is an inside host, it is worth looking for other signs of recon activ-ity. For example, is the host sending invalid fragments to multiple hosts? Is it scanning many hosts on the same port? Is it scanning many ports on one host? An inside host per-forming reconnaissance can be a good sign of unwanted activity or compromise."}, "frag packet too short": {"name": "Frag Packet Too Short", "mitigation": "Mitigation is not available for the alarm associated with this security event.", "meaning": "An IP packet with an invalid fragmentation value is not something that should normally happen. When it happens it has likely been done intentionally in an attempt to gather information about the machine the packet is sent to as different operating systems and versions may respond differently.", "steps": "If the source of this event is an inside host, it is worth looking for other signs of recon activ-ity. For example, is the host sending invalid fragments to multiple hosts? Is it scanning many hosts on the same port? Is it scanning many ports on one host? An inside host per-forming reconnaissance can be a good sign of unwanted activity or compromise."}, "frag sizes differ": {"name": "Frag Sizes Differ", "mitigation": "Mitigation is not available for the alarm associated with this security event.", "meaning": "An IP packet with different fragmentation sizes for each segment is not something that should normally happen. When it happens it has likely been done intentionally in an attempt to evade packet inspection tools along its route.", "steps": "If the source of this event is an inside host, it is worth looking for other signs of recon activ-ity. For example, is the host sending invalid fragments to multiple hosts? Is it scanning many hosts on the same port? Is it scanning many ports on one host? An inside host per-forming reconnaissance can be a good sign of unwanted activity or compromise."}, "half open attack": {"name": "Half Open Attack", "mitigation": "Check steps", "meaning": "This is a denial-of-service (DoS) attack. It is possible that a half open attack can be an attempt to exhaust either bandwidth or con-nection handlers since it opens connections but never carries them out, forcing the victim host to wait long enough to cause the mali-cious connections to time out.", "steps": "The goal is to determine if the connections to the target are legitimate and if the target experiences any performance degradation. While it is possible that this can be malicious behavior between two inside hosts, the event is more likely to be interesting between an inside and outside host. \n First, run a flow query between the source and target of the event for the day of the event. Take note of whether the flow is ongo-ing. If it is not, and there was no service out-age, it was likely not an issue. You can also check the security event history of both the source and target hosts. Does the source host have this event against multiple targets  or historically? If so, this is something to research further. \n Does the target host have many hosts trig-gering this  event against it at once but not his-torically? This may be sign of a distributed denial-of-servce (DDoS) attack. If the event is also firing historically, it may just be normal behavior for whatever application the service is hosting. If this is the case, consider turning set he event off for the particular host. \n If the relevant traffic was observed by a Flow Sensor, run a performance report to see if the SRT (Server Response Time) has been affected due to the nature of the traffic. This could indicate whether or not this is legit-imate traffic"}, "high file sharing index": {"name": "High File Sharing Index", "mitigation": "Check steps", "meaning": "The source is likely downloading an unusual amount of data from the target. This is a potential precursor to Data Hoarding and Data Exfiltration.", "steps": "Determine how much data was downloaded. As this may be a precursor to Suspect Data Hoarding, the steps are the same, except the initial target is known in this case.An ideal way to investigate this is to run a Top Peers (inbound) report for the source. Set the time period of the query to be the day of the event. Filter the report so that Client or Server Host is the source IP of the security event and Other Host is the Inside Hosts' host group. The goal is to find whether or not the source has done this across many tar-gets. \n If the target is the only host sending data to the source, run a Top Peers report for the tar-get to see if it has exhibited the same activity with other hosts. If so, it is worth invest-igating the target as the file sharing server to see if the activity is expected."}, "high smb peers": {"name": "High SMB Peers", "mitigation": "Check steps", "meaning": "Unless you know that this should be hap-pening in a particular scenario, or you have set the threshold very low, this event is almost certainly a sign of a compromised host. It is often a sign of malware looking to spread automatically via SMB.", "steps": "This security event is a probable sign of com-promise, but you can investigate it to see if the outside hosts belong to a particular range or to see how many of them have been con-tacted. To do this, start a flow query. Set the start time of the query to the day of the event. On the Filter dialog, on the Hosts tab, set Cli-ent or Server Host as the source of the event and Other Host is the Inside Hosts host group. On the Services & Applications tab, fil-ter by Services and include SMB. The query returns all relevant flows."}, "high total traffic": {"name": "High Total Traffic", "mitigation": "Check steps", "meaning": "Due to counting both inbound and outbound traffic, High Total Traffic is a general sign of anomalous behavior. It may be predominantly inbound, predominantly outbound, or a mixture of the two. The IP is simply involved in an abnormally higher amount of traffic.", "steps": "Determine how much data is moving and where that data is going to and coming from. An ideal way to investigate this is to perform a flow query for the source host. Set the time period to the day of the associated security event, and set the source host to be the cli-ent host or server host. \n Once the results have returned, find where the highest volume of data was going to or coming from; sort by Total Bytes to do this. The goal is to find the standout flow(s). \n After finding the standout flow(s), determine whether or not this is expected behavior."}, "high traffic": {"name": "High Traffic", "mitigation": "Check steps", "meaning": "Due to counting both inbound and outbound traffic, High Traffic is a general sign of anom-alous behavior. It may be predominantly inbound, predominantly outbound, or a mix-ture of the two. The IP is simply involved in an abnormally higher amount of traffic. It is a possible indicator of incoming or outgoing DoS.", "steps": "Determine how much data is moving and where that data is going to and coming from. An ideal way to investigate this is to perform a flow query for the source host. Set the start time of the query to five minutes before the start time of the associated security event, and set the end time to the end time of the alarm (if there is an alarm). Set the source host to be the client host or server host. \n Once the results have returned, find where the highest volume of data was going to or coming from; sort by Total Bytes to do this. The goal is to find the standout flow(s). \n After finding the standout flow(s), determine whether or not this is expected behavior."}, "high volume email": {"name": "High Volume Email", "mitigation": "Check steps", "meaning": "The host alerted on is potentially infected with a piece of email worm malware, or the host has been re-purposed for spamming.", "steps": "Determine the amount of data per flow going out and over which ports it is sending them out. \n Run two Top Peer reports—one filtered by pro-tocol and one filtered by flows—to see whether the host is propagating a worm across the network or is being used as an SMTP relay for spam purposes. \n Determine whether or not data being sent from these peers in the observed quantity is expected behavior."}, "host lock violation": {"name": "Host Lock Violation", "mitigation": "Check steps ", "meaning": "This is effectively a user-configured mon-itoring equivalent of a router's ACL. The meaning of the event can  vary depending on why a user decided to implement a particular host lock, but it is generally a connection that a user has deemed inappropriate based on the source, destination, and potential applic-ation.", "steps": "The investigatory steps for a host lock violation are entirely dependent on the context in which the host lock was  established."}, "icmp flood": {"name": "ICMP Flood", "mitigation": "Check steps", "meaning": "This indicates that the source host is engaged in a DoS attack (potentially caused by either a compromised host or driven by a user), a misconfigured network application, or a reconnaissance (during which the packets are sent across a very wide range of IPs rather than across a small group).", "steps": "Determine how many ICMP packets are being sent at what rate, when they were sent, and where they are going. An ideal way to invest-igate this is to perform a flow query for the source host. Set the start time of the query to five minutes before the start time of the asso-ciated security event, and set the end time to the end time of the alarm (if there is an alarm). Set the protocol filter to ICMP only. Once the results have returned, find where the most ICMP packets went during the searched time period. If the subject of the event is the client host in its ICMP- heavy flows, you can sort on Client Packets or Cli-ent Packet Rate (pps). The goal is to find the standout flow(s). After finding the standout flow(s), determine whether or not this is expected behavior."}, "icmp received": {"name": "ICMP Received", "mitigation": "Check steps", "meaning": "This indicates that the target host is being tar-geted in a DoS attack or a misconfigured net-work application.", "steps": "Determine how many ICMP packets are being received at what rate, when they were received, and from where they are coming. An ideal way to investigate this is to perform a flow query for the target host. Set the start time of the query to five minutes before the start time of the associated security event, and set the end time to the end time of the alarm (if there is an alarm). Set the protocol fil-ter to ICMP only. \n Once the results have returned, find where the most ICMP packets came from during the searched time period. If the subject of the event is the client host in its ICMP-heavy flows, you can sort on Client Packets or Cli-ent Packet Rate (pps). The goal is to find the standout flow(s). \n After finding the standout flow(s), determine whether or not this is expected behavior."}, "icmp timeout": {"name": "ICMP Timeout", "mitigation": "Mitigation is not available for the alarm associated with this security event.", "meaning": "The host is potentially scanning / mapping the network to determine which layer 4 pro-tocols are allowed through gate-ways/firewalls, etc.", "steps": "Determine if the host has been scanning ports along with the ICMP invocation.Run reports that show peers by port and pro-tocol to discern a pattern of ICMP as well as various ports, usually repeating across peers.Determine whether or not data patterns being sent from the host is expected behavior (security tool/device, etc)."}, "inside tor entry detected": {"name": "Inside Tor Entry Detected", "mitigation": "Check steps", "meaning": "Tor, formerly The Onion Router, is a network used for anonymizing Internet connections which works by sending a connection through multiple relays before exiting the Tor network. A Tor entry node is the first server a Tor connection  transits through before nav-igating and exiting the Tor network. This security event involves a host that is being monitored by your Stealthwatch Sys-tem and is being advertised as a Tor entry node. Hosting a Tor entry node is not neces-sarily an issue, however it's almost certainly not something that should be occurring without a network's administrators being aware. Unlike a Tor exit node, Tor entry nodes only forward traffic within the Tor network, so the main concern is usually bandwidth.", "steps": "The main goal of investigating this event is largely non-technical. Determine whether or not anyone is aware of the Tor entry node and if it is permitted. If so, disable the event for the specific permitted host. You can also view the host's security event history to find out when it began to communicate while being advertised as a Tor entry node."}, "inside tor exit detected": {"name": "Inside Tor Exit Detected", "mitigation": "Check steps", "meaning": "Tor, formerly The Onion Router, is a network used for anonymizing Internet connections which works by sending a connection through multiple relays before exiting the Tor network. A Tor exit node is the last relay through which a Tor connection exits the Tor network, and it is what the destination of a network connection ultimately see as as the source of the connection. \n This security event involves a host that is being monitored by your Stealthwatch Sys-tem and is being advertised as a Tor exit node. Hosting a Tor exit node is not neces-sarily an issue, however it's almost certainly not something that should be occurring without a network's administrators being aware. Concerns about hosting a Tor exit node often includes bandwidth  usage and potential legal concerns around the activity being proxied through the node.", "steps": "The main goal of investigating this event is largely non-technical. Determine whether or not anyone is aware of the Tor exit node and if it is permitted. If so, disable the event for the specific permitted host. You can also view the host's security event history to find out when it began to communicate while being advertised as a Tor exit node.  In addi-tion, you can run a Top Peers report to view the amount of bandwidth the server has con-sumed as well as where that bandwidth has been going."}, "mail rejects": {"name": "Mail Rejects", "mitigation": "Check steps", "meaning": "A host has received a number of Mail Rejec-ted messages that exceed the threshold and the host is not a mail server. These messages may occur for a number of reasons. For example, the sending server/IP is registered as a spam server and the intended mail recip-ient is no longer available.", "steps": "Determine whether the host is intended to be sending/receiving mail. \n Run a Top Peers report by Port / Protocol (25/SMTP) to see who the server has been communicating with. \n If the host is intended to be send-ing/receiving mail, check the SMTP con-figurations to ensure they are correct. \n Check the larger spam and mail blacklists to see if the host IP is listed. \n If the server is not intended to send and receive email, investigate the host to see when the services were installed and if it was compromised in order to accomplish this."}, "mail relay": {"name": "Mail Relay", "mitigation": "Check steps", "meaning": "The host is potentially being used as a mail relay. If a mail server is not configured to use authentication, it is left open to the outside world with the SMTP port (25) open and/or does not have configurations to limit the net-works that can relay mail. It may be taken advantage of by spammers.", "steps": "Determine the volume of email that is normal and whether the host is intended to send and receive email. If the server is intended to send and receive email, verify the SMTP server configurations. Enable authentication and network relay limits if they are not already enabled.If the server is not intended to send and receive email, investigate the host to see when the services were installed and whether the host was compromised to accom-plish this."}, "max flows initiated": {"name": "Max Flows Initiated", "mitigation": "Check steps", "meaning": "This can indicate several different issues, but you should first determine if this is a sign of reconnaissance or a host engaging in a DoS attack.", "steps": "Determine what is causing these types flows by finding a common link between them. For example, are most of these flows going to the same host? Are they going to different hosts using the same port? \n An ideal way to determine this is to run one of the top reports. You can start with either the Top Peers report or Top Ports report. Access the report and then, on the Hosts tab in the Filter dialog,  set the Direction field to Total, where Client is the source of the event and there are no exclusions for Server Host. On the Date/Time tab set the time period to five minutes before the start active time of the event up to the start active time of the event. On the Advanced tab, sort by Flows. Determine if the majority of the flows applies to a certain set of rows. (If this is not the case, run the other of the two suggested Top reports.) \n After finding the standout ports or peers, determine whether or not this is expected behavior."}, "max flows served": {"name": "Max Flows Served", "mitigation": "Check steps", "meaning": "This can indicate several different issues, but you should first determine if this is a sign of reconnaissance or a host being targeted in DoS attacks. For hosts that normally serve large volumes of traffic, it may just be an increase in normal use depending on threshold and tolerance settings.", "steps": "Determine what is causing these types flows by finding a common link between them. For example, are most of these flows coming from the same host? Are they coming from different hosts targeting the same port? \n An ideal way to determine this is to run one of the top reports. You can start with either the Top Peers report or Top Ports report. Access the report and then, on the Hosts tab in the Filter dialog,  set the Direction field to Total, where Server Host is the source of the event and there are no exclusions for Client. On the Date/Time tab set the time period to five minutes before the start active time of the event up to the start active time of the event. On the Advanced tab, sort by Flows. Determine if the majority of the flows applies to a certain set of rows. (If this is not the case, run the other of the two suggested Top reports.) \n After finding the standout ports or peers, determine whether or not this is expected behavior"}, "new flows initiated": {"name": "New Flows Initiated", "mitigation": "Check steps", "meaning": "This can indicate several different issues, but you should first determine if this is a sign of reconnaissance or a host engaging in a DoS attack.", "steps": "Determine what is causing these types flows by finding a common link between them. For example, are most of these flows going to the same host? Are they going to different hosts using the same port? \n An ideal way to determine this is to run one of the top reports. You can start with either the Top Peers report or Top Ports report. Access the report and then, on the Hosts tab in the Filter dialog,  set the Direction field to Total, where Client is the source of the event and there are no exclusions for Server Host. On the Date/Time tab set the time period to five minutes before the start active time of the event up to the start active time of the event. On the Advanced tab, sort by Flows. Determine if the majority of the flows applies to a certain set of rows. (If this is not the case, run the other of the two suggested Top reports.) \n After finding the standout ports or peers, determine whether or not this is expected behavior"}, "new flows served": {"name": "New Flows Served", "mitigation": "Check steps", "meaning": "This can indicate several different issues, but you should first determine if this is a sign of reconnaissance or a host being targeted in DoS attacks. For hosts that normally serve large volumes of traffic, it may just be an increase in normal use depending on threshold and tolerance settings.", "steps": "Determine what is causing these types flows by finding a common link between them. For example, are most of these flows going to the same host? Are they going to different hosts using the same port? \n An ideal way to determine this is to run one of the top reports. You can start with either the Top Peers report or Top Ports report. Access the report and then, on the Hosts tab in the Filter dialog,  set the Direction field to Total, where Server Host is the source of the event and there are no exclusions for Client. On the Date/Time tab set the time period to five minutes before the start active time of the event up to the start active time of the event. On the Advanced tab, sort by Flows. Determine if the majority of the flows applies to a certain set of rows. (If this is not the case, run the other of the two suggested Top reports.) \n After finding the standout ports or peers, determine whether or not this is expected behavior."}, "packet flood": {"name": "Packet Flood", "mitigation": "Check steps", "meaning": "The source is sending out a large volume of packets, where each packet is smaller in size than a traditional TCP packet. This is occur-ring over a long period of time, indicating that the source is attempting a DoS (Denial of Ser-vice) or Brute Force attack against the target.", "steps": "Run a Top Peers report on the source to see if it has executed any similar flows, perhaps slightly shorter in length and close in size to other hosts. This can be a precursor to the attack, as the attacker is trying to gauge resources on various machines and identify weak targets. \n Run a Top Peers report on the target to see if any other machines have been compromised or re-purposed to join in the attack but have not yet reached the timing threshold for the alarm to fire. \n Investigate the source to see if the flow activ-ity is behaving as expected.Configure DoS mitigation on the targets, if possible."}, "ping oversized packet": {"name": "Ping Oversized Packet", "mitigation": "Mitigation is not available for the alarm associated with this security event.", "meaning": "This may indicate that a covert channel for data exfiltration or secretive communication is being used. ICMP is used for standard con-trol or error response purposes, but it can be tunneled through to send and receive other data.", "steps": "Run a Top Services report to distinguish the excessive ICMP traffic from the all the other traffic sent to and from the host. \n Investigate the source and target hosts to see if unauthorized services are running. For example, a program or service must be run-ning on the host, target, or both to capture or send the ICMP traffic. \n Run a Top Peers report filtered by the ICMP application (see note below) to see if the source or target have been communicating with other peers over excessive ICMP or to unfavorable peers outside the network (data exfiltration). Filter the report by ICMP for the Applications \n Note: When configuring the Top Peers report, in the Connection section, click Select under Applications. "}, "ping scan": {"name": "Ping Scan", "mitigation": "Mitigation is not available for the alarm associated with this security event.", "meaning": "An ICMP scan is generally an early type of reconnaissance since, unlike scans of a par-ticular port across hosts or many ports on one host, it is simply searching for any responsive host rather than a particular service. A host ping scanning is generally just trying to find other active hosts on a network, possibly for further investigation.", "steps": "Determine what the host was scanning. Since this is an ICMP-based scan, your main goal is to figure out which hosts are being scanned rather than what particular services are being targeted, as you would with a UDP or TCP scan. You can investigate this by performing a flow query where the client host or server host is the source of the event, the time period is the day of the event, and the pro-tocol is ICMP. Sort the results by IP or host group of the peer to try to determine whether or not there is a pattern to the hosts being scanned."}, "port scan": {"name": "Port Scan", "mitigation": "Check steps", "meaning": "It means that a host has been observed \"port scanning\" another host. This means that the scanning host is attempting to identify which services the scanned host can provide. When this is done by an outside host, it can be the precursor to attempts at exploitation; scan-ning from the internet, however, is to be expected. When the scanning host is an inside host, it can be a sign of either an attacker or a compromised host trying to move laterally within an organization's net-work.", "steps": "If the source host of this security event is an outside host, check to see if it has had con-tinued communication with the host that it scanned. To do this, open a flow query between the source and target host. It may also be wise to simply view all traffic between the source host and your network. If the source of this host is an inside host, view the flows between the source and target using a Flow Query to determine whether or not this is expected behavior."}, "reset/tcp": {"name": "Reset/tcp", "mitigation": "Mitigation is not available for the alarm associated with this security event.", "meaning": "TCP Reset packets are sent when a TCP con-versation is torn down or when there is a prob-lem with the conversation. These can be sent by malfunctioning devices in the middle of a conversation (such as load balancers), or they can be sent by the target if a port is not open or available. In the case of the latter, if mul-tiple ports are responding this way and are in groups or are congruent, it usually indicates a network scan is being performed to determ-ine which services, if any, are available on a host.", "steps": "Run a Top Peers report for the source to determine if there is a pattern to the ports that are being used in the flows.Determine whether the source is a security host, device, or appliance that has been authorized to scan. If not, investigate the host for scanning software or services, as well as evidence of compromise."}, "reset/udp": {"name": "Reset/udp", "mitigation": "Mitigation is not available for the alarm associated with this security event.", "meaning": "UDP Reset packets are sent when com-munication to a UDP port that is closed or not available has been attempted. These packets can be sent by malfunctioning devices in the middle of a conversation or they can be sent by the target if a port is not open or available. In the case of the latter, if multiple ports are responding this way and are in groups or are congruent, it usually indicates a network scan is being performed to determine which ser-vices, if any, are available on a host.", "steps": "Run a Top Peers report for the source to determine if there is a pattern to the ports that are being used in the flows.Determine whether the source is a security host, device, or appliance that has been authorized to scan. If not, investigate the host for scanning software or services, as well as evidence of compromise."}, "scanner talking": {"name": "Scanner Talking", "mitigation": "Check Steps", "meaning": "A machine which has been flagged as an address scanner is communicating with one of the machines that has been scanned. If the source is not an authorized scanner, it can indicate the scanner has found a target match-ing its attack vector and has successfully com-promised it.", "steps": "Determine whether the source is an authorized scanner.If the  source is not an authorized scanner, run a Peer report for the source to see other hosts communicated to, making sure to choose peers that have increased flows or flow sizes.Investigate the source and target for signs of compromise."}, "slow connection flood": {"name": "Slow Connection Flood", "mitigation": "Check steps", "meaning": "Indicates that a host is initiating multiple con-nections to a target with a very low packet rate. The goal of connections like these are to maintain open connections without requiring much bandwidth. This is a type of application denial-of-service (DoS) attack which can render a service unavailable without requiring a large amount of bandwidth, which makes the attack easier to carry out against a vul-nerable host and often more difficult to detect.", "steps": "The goal is to determine if the connections to the target are legitimate and if the target experiences any performance degradation. While it is possible that this can be malicious behavior between two inside hosts, the event is more likely to be interesting between an inside and an outside host. First, run a flow query between the source and target of the event for the day of the event. Take note of whether the flow is ongoing. If it is not, and there was no service outage, it was likely not an issue. You can also check the security event history of both the source and target hosts. Does the source host have this event against multiple targets or historically? If so, this is something to research further. Does the target host have many hosts triggering this event against it at once but not his-torically? This may be sign of a distributed denial-of-servce (DDoS) attack. If the event is also firing historically, it may just be normal behavior for whatever application the service is hosting. If this is the case, consider turning t he event off for the particular host. If the rel-evant traffic was observed by a Flow Sensor, run a performance report to see if the SRT (Server Response Time) has been affected due to the nature of the traffic. This could indicate whether or not this is legitimate raffic."}, "spam source": {"name": "Spam Source", "mitigation": "Check steps", "meaning": "It can indicate that a server is being used to send spam email. This can be accomplished through compromise or misconfiguration. This can cause public IPs to be blocked by blacklists and spam lists.", "steps": "Determine if the source is intended to send and receive email. If the source is not meant to do so, determine when the increase in volume of outgoing email began. Search for signs of compromise or malicious software installation around that time. If the source is intended to send and receive email, determine when the source first appeared on the network and search for signs of compromise."}, "ssh reverse shell": {"name": "SSH Reverse Shell", "mitigation": "Check steps", "meaning": "The intent of this security event alarm is to find a reverse SSH shell. An attacker may use an SSH reverse shell as a method of estab-lishing on-demand access to the com-promised network through what looks like an outbound SSH connection. This allows an attacker to maintain access to a system even when incoming connections are blocked off by something like a firewall.", "steps": "When investigating this security event, it is important to keep the role of the source host, presumably on the inside network, in per-spective. If the host in question is an SSH or SFTP server in an official capacity, this could be a false alarm, and further host policy tun-ing may be required to limit these alarms from such devices. However, in a situation where inside hosts do not have any obvious capa-city as such a device, the identity of the out-side host in question must be established. Is it owned by a well-known entity? If so, it could be a false alarm. If it is not a well-known entity, run a Top Peers (outbound) report on the target host. This report provides a list of inside peers sorted by the amount of data that have communicated with the out-side host. This indicates whether or not it a very common peer within your environment and can potentially assist you in determining if this behavior is expected."}, "stealth scan/tcp": {"name": "Stealth Scan/tcp", "mitigation": "Mitigation is not available for the alarm associated with this security event.", "meaning": "N/A", "steps": "N/A"}, "stealth scan/udp": {"name": "Stealth Scan/udp", "mitigation": "Mitigation is not available for the alarm associated with this security event.", "meaning": "N/A", "steps": "N/A"}, "suspect data hoarding": {"name": "Suspect Data Hoarding", "mitigation": "Check Steps", "meaning": "This event is potentially an indication of a par-ticular host gathering data to prepare for exfiltration or other large-than-normal down-loads of internal data.", "steps": "Determine how much data was downloaded and where that data was downloaded from. \n An ideal way to investigate this is to run a Top Peers (inbound) report. Set the time period of the query to be the day of the event. Filter the report so that Client or Server Host is the source IP of the security event and Other Host is the Inside Hosts host group. The goal is to find the standout peers who sent the majority of the data.After finding the standout peers, determine whether or not data being sent from these peers in the observed quantity is expected behavior."}, "suspect data loss": {"name": "Suspect Data Loss", "mitigation": "Check Steps", "meaning": "A host is being used to upload more inform-ation to the Internet than is acceptable. This can be anything from someone using external backup services to maliciously exfiltrating cor-porate data.", "steps": "Determine how much data was uploaded and where the bulk of that data went. \n An ideal way to determine this is to run a Top Peers (outbound) report on the host that was the source of the security event. Filter the report so that the client is the source of the event and the server host group is set to Out-side Hosts. The goal is to find the standout peers who received the majority of the data. \n After finding the standout peers, determine whether or not data being received by these peers in the observed quantity is expected behavior."}, "suspect long flow": {"name": "Suspect Long Flow", "mitigation": "Check Steps", "meaning": "This security event detects long-established connections such as the ones used by remote desktop technologies and VPN, but it can also detect communication channels such as spyware,IRCbotnets,and other covert means of communication.This event is not necessarily indicative of malicious behavior or compromise by itself,but it contributes to the identification of interesting hosts.", "steps": "The goal is to determine if this traffic rep-resents normal activity. Oftentimes you can do this by identifying the destination of the traffic. A good starting point is to pivot into the associated flow table for the security event to get more details of the flow such  as source and destination IP addresses, ports, services, starting time of the flow, geo-loc-ation information, and username (if available). \n If the target is an outside host, run an external lookup to verify the owner of the IP. If the target is a known business partner or trusted network, you should classify the tar-get  into its corresponding group. If an external lookup of the host is not enough to identify it, run a Top Peer reports to identify other hosts communicating with the target to identify similar behaviors."}, "suspect quiet long flow": {"name": "Suspect Quiet Long Flow", "mitigation": "Check Steps", "meaning": "This security event identifies heartbeat con-nections that are used in some types of com-mand and control (C&C) activity as well as other suspicious communication channels such as spyware, IRC botnets, and other cov-ert means of communication. This event is similar to a beaconing host except that bid-irectional communications are included, provided a low volume of data is transferred. Note that this event can also identify back-ground website heartbeats.", "steps": "The goal is to determine if this traffic rep-resents normal activity. Oftentimes you can do this by identifying the destination of the traffic. A good starting point is to pivot into the associated flow table for the security event to get more details of the flow such  as source and destination IP addresses, ports, services, starting time of the flow, geo-loc-ation information, and username (if available). \n If the target is an outside host, run an external lookup to verify the owner of the IP. If the target is a known business partner or trusted network, you should classify the tar-get  into its corresponding group. If an external lookup of the host is not enough to identify it, run a Top Peer reports to identify other hosts communicating with the target to identify similar behaviors. You can also run a Flow Traffic report to visualize suspicious traffic patterns. Heartbeats to a C&C server will exhibit a periodic pattern with a low amount of bytes transferred. "}, "suspect udp activity": {"name": "Suspect UDP Activity", "mitigation": "Check Steps", "meaning": "The source host has successfully sent a single, large UDP packet to one of the pre-viously scanned hosts.", "steps": "Investigate this activity immediately, since it is most commonly identified with many UDP-based worms."}, "syn flood": {"name": "SYN Flood", "mitigation": "Check Steps", "meaning": "This indicates that the source host is engaged in a DoS attack (potentially caused by either a compromised host or driven by a user) or a misconfigured network application. Many SYN packets are often sent to consume a target’s bandwidth as part of larger, dis-tributed denial-of- service (DDoS) attacks. However, it is possible that an application is failing to establish a TCP connection and is trying to re-establish one at a very high rate. Relatively low packet counts relative to a large number of IPs is also likely to be a sign of reconnaissance.", "steps": "Determine how many SYNs are being sent at what rate, when they were sent, and where they are going. An ideal way to investigate this is to perform a flow query for the source host. Set the start time of the query to five minutes before the start time of the asso-ciated security event, and set the end time to the end time of the alarm (if there is an alarm). Once the results have returned, find where the most SYN packets went during the searched time period. If the subject of the event is the client host in its SYN- heavy flows, you can sort on Client SYN Packets, Client Packets, or Client Packet Rate (pps). The goal is to find the standout flow(s). After finding the standout flow(s), determine whether or not this is a misconfiguration. An Inside to Inside SYN Flood is often a mis-configuration; an Inside to Outside SYN Flood occasionally is."}, "syns received": {"name": "SYNs Received", "mitigation": "Check Steps:", "meaning": "This indicates that the target host is being tar-geted in a DoS attack or misconfigured net-work application. Many SYN packets are often sent to consume a target’s bandwidth as part of larger DDoS or DoS attacks. However, it is possible that an application is failing to estab-lish a TCP connection and trying to re-estab-lish one at a very high rate.", "steps": "Determine how many SYNs are being sent at what rate, when they were sent, and from where they are coming. An ideal way to investigate this is to perform a flow query for the target host. Set the start time of the query to five minutes before the start time of the associated security event, and set the end time to the end time of the alarm (if there is an alarm). \n Once the results have returned, find where the most SYN packets came from during the searched time period. If the target of the event is the server host in its SYN-heavy flows, you can sort on Client SYN Packets, Client Packets, or Client Packet Rate (pps). The goal is to find the standout flow(s). \n After you find the standout flow(s), determine whether or not this is a misconfiguration. An Inside to Inside SYN Flood is often a misconfiguration."}, "talks to phantoms": {"name": "Talks to Phantoms", "mitigation": "Check Steps", "meaning": "Since computers rarely attempt to send unso-licited traffic to hosts that do not exist, a host involved in such activity is noteworthy. It is possible that this is a sign of someone attempting to perform reconnaissance, how-ever, it is also possible that a host has been misconfigured to talk to nonexistent hosts.", "steps": "This security event can be a little tricky to investigate since it is not possible today to specify \"phantoms\" as part of a flow query, but you can get close. The goal of the invest-igation is to find the flows that were sent to unresponsive hosts and draw meaning from the common thread between the flows. Find the unidirectional flows. Build a flow query where the time range is the day of the security event. Make the client host the source IP of the security event, and allow the server host to be any IP. In the Traffic tab, fil-ter so that the number of server packets are less than / equal to 0.* Find the common thread between these flows. For example, were they all going to the same server port? Did they all occur at approximately the same time? Were they going to hosts that you know once existed? How many hosts were there? * To make sure everything is captured, you should repeat this query where the source of the event is the server of the flow query, and client packets are less than / equal to 0. Note that this is unlikely to produce additional res-ults too frequently."}, "target data hoarding": {"name": "Target Data Hoarding", "mitigation": "Check Steps", "meaning": "This event is potentially an indication of one or many Inside Hosts gathering more data than normal from a particular Inside Host, potentially in preparation for exfiltration or misuse.", "steps": "Determine how much data was transferred and where the bulk of that data went.An ideal way to determine this is to run a Top Peers (outbound) report on the host that was the source of the security event. Filter the report so that Client or Server Host is the tar-get IP of the security event and Other Host is the Inside Hosts host group. The goal is to find the standout peers who received the majority of the uploaded data.After finding the standout peers, determine whether or not data being received by these peers in the observed quantity is expected behavior."}, "timeout/tcp": {"name": "Timeout/tcp", "mitigation": "Mitigation is not available for the alarm associated with this security event.", "meaning": "N/A", "steps": "N/A"}, "timeout/udp": {"name": "Timeout/udp", "mitigation": "Mitigation is not available for the alarm associated with this security event.", "meaning": "N/A", "steps": "N/A"}, "udp flood": {"name": "UDP Flood", "mitigation": "Check Steps", "meaning": "This indicates that the source host is engaged in a DoS attack (potentially caused by either a compromised host or driven by a user), a misconfigured network application, or a connection with abnormally high UDP pack-ets per second from the source. Many packets are often sent to consume a target’s band-width as part of larger DDoS attacks. \n However, high UDP packet rates are more typ-ical than high SYN packet rates, so a low threshold or tolerance setting may cause a high volume of false positives. Relatively low packet counts relative to a large amount of IPs is also likely to be a sign of recon-naissance.", "steps": "Determine how many UDP packets are being sent at what rate, when they were sent, and where they are going. An ideal way to invest-igate this is to perform a flow query for the source host. Set the start time of the query to five minutes before the start time of the asso-ciated security event, and set the end time to the end time of the alarm (if there is an alarm). Set the protocol filter to UDP only. \n Once the results have returned, find where the most UDP packets went during the searched time period. If the subject of the event is the client host in its UDP-heavy flows, you can sort on Client Packets or Cli-ent Packet Rate (pps). The goal is to find the standout flow(s). \n After finding the standout flow(s), determine whether or not this is expected behavior. Examples of expected behavior is a UDP-based VPN connection or uploads to a web server using UDP (like Google often does)."}, "udp received": {"name": "UDP Received", "mitigation": "Check Steps", "meaning": "This indicates that the target hosted is being targeted in a DoS attack, a misconfigured net-work application, or a connection with abnor-mally high UDP packets per second from the source(s). Many packets are often sent to con-sume a target’s bandwidth as part of larger DDoS attacks. However, high UDP packet rates are more typical than high SYN packet rates, so a low threshold or tolerance setting may cause a high volume of false positives.", "steps": "The goal is to determine how many UDP pack-ets are being received at what rate, when they were received, and where they are com-ing from. \n An ideal way to investigate this is to perform a flow query for the target host. Set the start time of the query to five minutes before the start time of the associated security event, and set the end time to the end time of the alarm (if there is an alarm). Set the protocol fil-ter to UDP only. \n Once the results have returned, find where the most UDP packets came from during the searched time period. If the target of the event is the server host in its UDP-heavy flows, you can sort on either Client Packets or Client Packet Rate (pps). The goal is to find the standout flow(s). \n After finding the standout flow(s), determine whether or not this is expected behavior. An example of expected behavior is a UDP-based VPN connection"}, "watch host active": {"name": "Watch Host Active", "mitigation": "Check Steps", "meaning": "This is a user configured event that notifies you when a particular host is observed com-municating. The meaning of the event can vary depending on why a user decided to put a particular host on the watch list, but it is generally a sign that any communication to or from the monitored host is inappropriate.", "steps": "The investigatory steps for this security event are entirely dependent on the context in which the host was added to  the watch list."}, "watch port active": {"name": "Watch Port Active", "mitigation": "Check Steps", "meaning": "This is a user configured event that notifies you when a particular host is observed com-municating over a particular port. The mean-ing of the event can vary depending on why a user decided to put a particular host on the watch list, but it is generally a sign that any communication to or from the monitored host is inappropriate.", "steps": "The investigatory steps for this security event are entirely dependent on the context in which the port was added to  the watch list."}, "worm activity": {"name": "Worm Activity", "mitigation": "Check Steps", "meaning": "This security event indicates that a host appears to be performing an excess amount of reconnaissance across various internal net-works, which may indicate that the host is compromised and attempting to propagate an infection throughout a network.", "steps": "This event can be noisy and its success largely depends on how well network scan-ners have been identified and placed into the network scanners host group. By doing this, these devices will inherit a policy that dis-ables worm activity. Worm activity largely hinges upon a host scanning for similar ports across different logical /24 ranges. Begin by running a Top Ports (outbound) report. Set the time period to the day of the event and the client host to be the source IP of the event. Regardless of the target IP range that is listed, you can scan any type of host, so determine if you want to search on inside hosts, outside hosts, or both. On the Hosts tab in the Filter dialog, set the Server filter as appropriate, and on the Advanced tab, set the \"Order the records returned by\" to Flows. Sort the results by peers. Regardless, start at the top of the list as sorted by flows or peers to find the standout ports that either do not belong or appear abnormally high. Right-click an IP address to pivot to the flows to view the various IP addresses and determine if par-ticular host groups are those being primarily targeted. You can also right- click and pivot to the Top Peers report to determine whether or not the traffic is spread generally equally across the targets. It is also worth noting the percentage of hosts that responded to the scans. At this point you should be able to determine who the host was scanning and what ports were being scanned."}, "worm propagation": {"name": "Worm Propagation", "mitigation": "Check Steps", "meaning": "This event seeks to find hosts that have been compromised by another compromised host, which results in the host attempting to com-promise other hosts. This involves the fol-lowing sequence of events: 1) A host is scanned by another host that is in the pro-cess of scanning multiple hosts; 2) The host that was just scanned now starts to scan other hosts.", "steps": "Run a Top Peers report on the host in ques-tion. Examine what other peer hosts con-tacted the subject on the specified port, filtering the report by the port in question. Verify that these hosts are not known scan-ners and should not have been participating in the observed scanning activity. If they are known scanners, the risk may be reduced. If they are not known scanners, the risk may increase since the scan was not legitimate or sanctioned. In this case, the event may indic-ate that the host is compromised."}}